{"id":"8699","ageRating":"PG","ageRatingGuide":"Teens 13 or older","averageRating":83.32,"canonicalTitle":"Nanatsu no Taizai","episodeCount":24,"subtype":"TV","synopsis":"In a world similar to the European Middle Ages, the feared yet revered Holy Knights of Britannia use immensely powerful magic to protect the region of Britannia and its kingdoms. However, a small subset of the Knights supposedly betrayed their homeland and turned their blades against their comrades in an attempt to overthrow the ruler of Liones. They were defeated by the Holy Knights, but rumors continued to persist that these legendary knights, called the \"Seven Deadly Sins,\" were still alive. Ten years later, the Holy Knights themselves staged a coup d’état, and thus became the new, tyrannical rulers of the Kingdom of Liones.\n\nBased on the best-selling manga series of the same name, Nanatsu no Taizai follows the adventures of Elizabeth, the third princess of the Kingdom of Liones, and her search for the Seven Deadly Sins. With their help, she endeavors to not only take back her kingdom from the Holy Knights, but to also seek justice in an unjust world.\n\n(Source: MAL Rewrite)","titles":{"en":"The Seven Deadly Sins","en_jp":"Nanatsu no Taizai","en_us":"The Seven Deadly Sins","ja_jp":"七つの大罪"},"coverImage":{"tiny":"https://media.kitsu.io/anime/cover_images/8699/tiny.jpg?1597701666","small":"https://media.kitsu.io/anime/cover_images/8699/small.jpg?1597701666","large":"https://media.kitsu.io/anime/cover_images/8699/large.jpg?1597701666","original":"https://media.kitsu.io/anime/cover_images/8699/original.jpg?1597701666","meta":{"dimensions":{"tiny":{"width":840,"height":200},"small":{"width":1680,"height":400},"large":{"width":3360,"height":800}}}},"youtubeVideoId":"wxcvbL6o55M","categories":[{"slug":"super-power","title":"Super Power"},{"slug":"action","title":"Action"},{"slug":"fantasy","title":"Fantasy"},{"slug":"adventure","title":"Adventure"},{"slug":"comedy","title":"Comedy"},{"slug":"ecchi","title":"Ecchi"}],"characters":[{"id":"77582","canonicalName":"Diane","names":{"en":"Diane","ja_jp":"ディアンヌ"},"description":"Diane is a member of the Seven Deadly Sins and is The Sin of Envy with the symbol of the Serpent. She is also a member of the Giant's Clan. <br><br>She is a fair maiden with pink eyes and medium length brown hair which is tied up into Mega Twintails. Despite being a beautiful looking maiden, she is in fact a giant from the giant clan, and is several times larger than ordinary humans. She wears a one piece orange suit, boots that extend almost up to the knees, and a metal armband which is embedded with shiny metal pebbles. Her current outfits and attire is believed to be the most fashionable ones. She wears an orange colored short sleeved bodysuit and boots. <br><br>As the Serpent's Sin of Envy, her main traits are jealousy and envy. She shows strong affection for Meliodas, so when she met him together with Elizabeth, she grew very jealous and threw him away whilst calling him a cheater. In contrary with Elizabeth who wants to be strong and powerful, she wants to be small.<br><br><span class=\"spoiler\">In the manga, she admitted she has feelings for the King.</span>","image":{"original":"https://media.kitsu.io/characters/images/77582/original.jpg?1485081402","meta":{"dimensions":{}}},"otherNames":["Serpent's Sin of Envy","Matrona"]},{"id":"57106","canonicalName":"Gowther","names":{"en":"Gowther","ja_jp":"ゴウセル"},"description":"Birthday: June 2<br><br>He is a member of the Seven Deadly Sins and the Sin of Lust with the symbol of the Goat. He is first mentioned to be engaged in battle with the order of Holy Knights, Dawn Roar. <br><br><span class=\"spoiler\">It is revealed in chapter 114 that Gowther was actually created by a great magician and his original form is a doll.</span><br><span class=\"spoiler\">In chapter 153 the demon Fraudrin claimed that he was once one of the original Ten Commandments of the Demon Clan with the attribute \"selflessness.\"</span>","image":{"original":"https://media.kitsu.io/characters/images/57106/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":["Goat's Sin of Lust","Armored Giant","Armando"]},{"id":"71170","canonicalName":"Hawk","names":{"en":"Hawk","ja_jp":"ホーク"},"description":"Hawk is a talking pig and Meliodas's companion. He is introduced as the cleaner of the Boar Hat bar who helps clean the disgusting food scraps.<br><br>He is a relatively large pink pig who wears an eye ring with the word star boar on his left ear. His body is well rounded and his legs are fairly short. He has a unique patch of black spots shaped like a four leafed clover. His body and appearance is fairly similar to a typical Gloucestershire Old Spots Pig.<br><br>He is seen to possess great strength and speed for his small stature as shown when he was able to knock down a locked metal dungeon door and take out dungeon guards single handed and when escaping and taking Elizabeth to safety. He is also very courageous and always tries to protect his friends.","image":{"original":"https://media.kitsu.io/characters/images/71170/original.jpg?1485079110","meta":{"dimensions":{}}},"otherNames":[]},{"id":"85352","canonicalName":"King","names":{"en":"King","ja_jp":"キング"},"description":"King is a member of the Seven Deadly Sins and is the Sin of Sloth with the symbol of the Grizzly. He is the master of Black Hound Oslo (オスロ).\r\n\r\nKing's wanted poster depicts him as big man with short hair, side burns, a bulbish nose, and a sneer. His true appearance is that of a young boy and he is often mistaken for a child.\r\n\r\nHis Seven Deadly Sins Grizzly symbol is located just above his left ankle and on the outer side of his lower leg. He possesses the Sacred Treasure known as Spirit Spear Chastiefol which he uses in conjunction with his power Disaster.","image":{"original":"https://media.kitsu.io/characters/images/85352/original.jpg?1485084448","meta":{"dimensions":{}}},"otherNames":["Sin of Sloth","Grizzly's Sin"]},{"id":"52951","canonicalName":"Elizabeth Liones","names":{"en":"Elizabeth Liones","ja_jp":"エリザベス・リオネス"},"description":"Birthday: June 12<br><br>Elizabeth is the third princess of Britannia. She is on a mission to find the Seven Deadly Sins, which are needed to help reclaim the Britannia kingdom.<br><br><span class=\"spoiler\">When Hawk \"dies,\" she is revealed as a \"special existence\" called the apostle of the goddesses and has special healing powers.</span><br><br><span class=\"spoiler\">She is a reincarnation of Meliodas's love interest \"Liz\".</span><br><br><span class=\"spoiler\">In the manga, it is revealed that she loves Meliodas.</span>","image":{"original":"https://media.kitsu.io/characters/images/52951/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"52950","canonicalName":"Meliodas","names":{"en":"Meliodas","ja_jp":"メリオダス"},"description":"Meliodas the leader of the Seven Deadly Sins and the Sin of Wrath with the symbol of the Dragon. He is the main protagonist of the Nanatsu no Taizai and the owner of the Boar Hat bar.<br><br><span class=\"spoiler\">Despite having the appearance of a child, Meliodas is actually much older, being at least 3000 years old.</span><br><span class=\"spoiler\">Meliodas once came from the kingdom of Danafor where he was the leader of the Holy Knights. When a slave girl named Liz who came from the enemy kingdom came to Danafor for an ambush mission, Liz was then captured by the knights and was sentenced to death, but Meliodas set her free and personally offered to fight on her behalf if anyone objected. Meliodas later took Liz to his house where they lived together, often groping her chest to which she reacted violently. Later, Liz grew closer to Meliodas and became his lover, Meliodas calling her his \"most important person to him.\" He has stated that he tried to protect Danafor and Liz, but failed, and that this is his sin, as a member of the Deadly Sins.</span>","image":{"original":"https://media.kitsu.io/characters/images/52950/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":["The Dragon's Sin of Wrath","Meliodafu"]},{"id":"58995","canonicalName":"Alioni","names":{"en":"Alioni","ja_jp":"アリオーニ"},"description":"Alioni is a member of the group of knights, Beard of the Mountain Cat, which was garrisoned at the base of the mountain in Kaynes Village, and claimed to serve under a Holy Knight. He was first seen beside his fellow knights trying to capture to capture the enigmatic and infamous Rust Knight who had appeared at the mysterious bar, the Boar Hat.<br><br>(Source: Nanatsu no Taizai Wiki)","image":{"original":"https://media.kitsu.io/characters/images/58995/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57121","canonicalName":"Cain Barzad","names":{"en":"Cain Barzad","ja_jp":"ケイン・バルザド"},"description":"Cain is a short elderly man with combed hair, and a long mustache and beard. He also wears a clock, and his eyes seem to be always closed. Under his cloak, Cain wears trousers, and a long shirt that bears the crest of Danafor. He seem like a drunk, and strange, weak old man but deep down he might be a powerful fighter and wanted to have revenge on Meliodas for destroying their kingdom long time ago, he seem to be shock when he found out he wasn't Meliodas' son and that he didn't age.","image":{"original":"https://media.kitsu.io/characters/images/57121/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":["Drunken Old Man","The Flame"]},{"id":"80536","canonicalName":"Dale","names":{"en":"Dale","ja_jp":"デール"},"description":"A Holy Knight and father of Guila and Zeal. Although Dale is labeled as a traitor after his disappearance, the incident is shrouded in mystery.","image":{"original":"https://media.kitsu.io/characters/images/80536/original.jpg?1485082469","meta":{"dimensions":{}}},"otherNames":[]},{"id":"77269","canonicalName":"Dana","names":{"en":"Dana","ja_jp":"ダナ"},"description":"","image":{"original":"https://media.kitsu.io/characters/images/77269/original.jpg?1485081292","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57116","canonicalName":"Dreyfus","names":{"en":"Dreyfus","ja_jp":"ドレファス"},"description":"Dreyfus is one of the current Great Holy Knights, thus also making him one of the two people who have command over the entirety of Britannia after the coup d'état. His attire consists of a standard set of a Holy Knight's armor that has a spike on each shoulder. He has long black hair that reaches up to his shoulder, with a short beard.","image":{"original":"https://media.kitsu.io/characters/images/57116/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"71531","canonicalName":"Elaine","names":{"en":"Elaine","ja_jp":"エレイン"},"description":"Elaine is King's sister, and the Guardian Saint of the Fountain of Youth. She has long and thin eyelashes, and cut hair that reaches her neck. She wears a single white one-piece dress which is tied together with a butterfly knot at the back. Elaine is shown to be a kind, caring and forgiving girl.","image":{"original":"https://media.kitsu.io/characters/images/71531/original.jpg?1485079229","meta":{"dimensions":{}}},"otherNames":[]},{"id":"71547","canonicalName":"Ellen","names":{"en":"Ellen","ja_jp":"エレン"},"description":"She is the sister of Luigi. She knows the way into the Capital of the Dead.","image":{"original":"https://media.kitsu.io/characters/images/71547/original.jpg?1485079235","meta":{"dimensions":{}}},"otherNames":[]},{"id":"76336","canonicalName":"Friesia","names":{"en":"Friesia","ja_jp":"フリージア"},"description":"Friesia is a Holy Knight with the ability to manipulate insects. Belonging to the infamous Weird Fangs stationed at Baste Dungeon, she aided in the capture of the Deadly Sin, Ban.<br><br>Manga Debut: Chapter 8<br>Anime Debut: Episode 4<br><br>(Source: nanatsu-no-taizai.wikia)","image":{"original":"https://media.kitsu.io/characters/images/76336/original.jpg?1485080964","meta":{"dimensions":{}}},"otherNames":["Freesia"]},{"id":"57120","canonicalName":"Gilthunder","names":{"en":"Gilthunder","ja_jp":"ギルサンダー"},"description":"One of the holy knights of the Britannia kingdom. He wishes both to purge traitorous knights and to prove his strength by defeating the seven deadly sins. He specifically wishes to defeat Meliodas whom he once looked up to in order to prove he's surpassed both his father and his killer.<br><br>He resides over fort Solgales and blocked off the water supply in Bernia with his sword before Meliodas removed it.","image":{"original":"https://media.kitsu.io/characters/images/57120/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":["Gil","Little Gil"]},{"id":"57111","canonicalName":"Golgius","names":{"en":"Golgius","ja_jp":"ゴルギウス"},"description":"A holy knight of the weird fangs. Golgius uses underhanded and deceitful tactics in order to get his way. Contracts a doctor to poison Melodidas while holding his daughter hostage and making off with Elizabeth and his sword, also tries to assassinate Melodidas while holding his hands up in surrender.<br><br>He has the power of transparency, which he claims to be teleportation.","image":{"original":"https://media.kitsu.io/characters/images/57111/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57117","canonicalName":"Griamore","names":{"en":"Griamore","ja_jp":"グリアモール"},"description":"Griamore is a Holy Knight who comes from a lineage of Holy Knights that have served the kingdom of Lyonesse for many generations. He is Veronica's bodyguard, and shows absolute loyalty towards her.<br><br>Griamore is a very tall and muscular individual who is at least twice the height of ordinary civilians, and has grey shoulder length hair. His attire consists of a single-spiked helmet, full leg armor and no upper body clothing, except a mysterious metal plate strapped around his chest with two straps. He also wears a glove on one hand and a sleeve-armor on the other arm. He, like many other Holy Knights, is heartless and cruel. Although he is ruthless, he shows absolute loyalty to Veronica and cannot allow himself to displease her, having started to serve her at a quite young age, even role-playing as a horse for her to ride on as a child.","image":{"original":"https://media.kitsu.io/characters/images/57117/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57112","canonicalName":"Guila","names":{"en":"Guila","ja_jp":"ギーラ"},"description":"Guila is a member of the New Generation of the Holy Knights. She is a young female with a slim build. She has long black hair and her eyes are depicted as if they are closed.<br><br>She has a younger brother named Zeal.","image":{"original":"https://media.kitsu.io/characters/images/57112/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"68545","canonicalName":"Gustaf","names":{"en":"Gustaf","ja_jp":"グスタフ "},"description":"Gustaf is a Ruby ranked Holy Knight and Jericho's older brother. <br><br>(Source: Nanatsu no Taizai Wikia)","image":{"original":"https://media.kitsu.io/characters/images/68545/original.jpg?1485078187","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57107","canonicalName":"Helbram","names":{"en":"Helbram","ja_jp":"ヘルブラム"},"description":"Helbram is a Holy Knight, Geera's master, and the subordinate of the Great Holy Knight, Hendricksen.<br><br>He wears a set of copper-colored full body armor, adorning it with a purple coat on top. He usually covers his face with a unique helm with a skyblue crest on it. Helbram has a serious personality, but also a playful side, which is seen when he jokes that Meliodas' decoration of Geera's face was not very bad. Helbram was also shown to like doing research, even taking notes during battle.<br><br><span class=\"spoiler\">During the fighting festival in the Byzel Arc, he disguised himself as a referee with the alias of Love Helm.</span>","image":{"original":"https://media.kitsu.io/characters/images/57107/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57119","canonicalName":"Hendrickson","names":{"en":"Hendrickson","ja_jp":"ヘンドリクセン"},"description":"Hendrickson is one of the current Great Holy Knights, thus also making him one of the two people who have command over the entirety of Britannia after the coup d'état. He wears a set of and covers it with a robe on top. He has short light-colored hair and also a goatee. Hendrickson is a serious man, who, like Dreyfus, appears to be willing to capture the king and enslave the citizens to prepare for the Holy War. However, he also seems to be plotting something.","image":{"original":"https://media.kitsu.io/characters/images/57119/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57109","canonicalName":"Howzer","names":{"en":"Howzer","ja_jp":"ハウザー"},"description":"Howzer is a Holy Knight, a colleague and partner of Gilthunder, and a subordinate of the Great Holy Knight, Dreyfus. He wears a set of Holy Knight armor and has short light-colored curled up hair. Howzer demonstrates a lot of self confidence and is very optimistic, which is the complete opposite of Gilthunder's personality; he is also shown to be somewhat naive and stupid.","image":{"original":"https://media.kitsu.io/characters/images/57109/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"66614","canonicalName":"Weinheidt","names":{"en":"Weinheidt","ja_jp":"ワインハイト"},"description":"Weinheidt was a member from the group of Holy Knights, Dawn Roar and was the marksman of the team.<br><br>Weinheidt was a well-built man with a short beard and mustache and wears a set of medieval archer clothing with a small cloak draped around his shoulders.<br><br>Like the other Dawn Roar members, Weinheidt was willing to kill anybody for the mission. He was faithful to whatever mission his team is assigned to and doesn't care about the motives behind the mission as long as the job gets done, although he can be curious sometimes.<br><br>Despite the Holy Knights' coup, Weinheidt retains his loyalty to the king along with his teammates when Baltra ordered Dawn Roar to stop Slader from hurting himself, to which Weinheidt complied.","image":{"original":"https://media.kitsu.io/characters/images/66614/original.jpg?1485075233","meta":{"dimensions":{}}},"otherNames":[]},{"id":"85449","canonicalName":"Ban","names":{"en":"Ban","ja_jp":"バン"},"description":"Age: 43<br>Height: 210 cm (6'11\")<br><span class=\"spoiler\">Magic: Snatch</span><br>Ban is a member of the Seven Deadly Sins and is The Sin of Greed with the symbol of the Fox. He was imprisoned in the Baste Dungeon. <br><br><span class=\"spoiler\">It is later discovered that Ban gained immortality from the fountain of youth in The Fairy King's Forest which lead to his self-appointed nickname ''Undead Ban'.' This also gave birth to him being the Fox of greed. He had originally come to the Fairy King's Forest to steal the Fountain of Youth but stopped when the Guardian Spirit, Elaine, told him it would destroy the forest. He bonded with Elaine and helped defend the fountain from a demon that attacked the forest. Elaine then gave the drink to Ban who was injured and near death, sacrificing herself in the process.</span>","image":{"original":"https://media.kitsu.io/characters/images/85449/original.jpg?1485084482","meta":{"dimensions":{}}},"otherNames":["Sin of Greed","Fox Sin","Bandit Ban","Undead Ban","Bain"]},{"id":"57114","canonicalName":"Jericho","names":{"en":"Jericho","ja_jp":"ジェリコ"},"description":"Jericho is an apprentice Holy Knight who served under the Weird Fangs. She was stationed at the Baste Dungeon, where the Deadly Sin, Ban was imprisoned. She is young woman of slim build, with light hair that is swept over the left side of her face and tied into a ponytail at the back. She wears a black coat over her armor, adorned with a cross on the left side and larger cross covering the back. Underneath her armor are similarly fashioned black clothes. Metal gauntlets cover her arms, while metal greaves and sabatons cover her legs and feet. <br><br>Jericho is a proud and serious individual. She is stern in her command over the guards of Baste Dungeon and overconfident in her abilities, appearing arrogant at times, which led to her humiliation by Ban.","image":{"original":"https://media.kitsu.io/characters/images/57114/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"75937","canonicalName":"Jude","names":{"en":"Jude","ja_jp":"ジュド"},"description":"A Holy Knight, and one of the four Weird Fangs of Baste Dungeon who captured and imprisoned Ban. Jude is known to have tortured Ban mercilessly during the Sin's imprisonment.","image":{"original":"https://media.kitsu.io/characters/images/75937/original.jpg?1485080823","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57123","canonicalName":"Margaret Liones","names":{"en":"Margaret Liones","ja_jp":"マーガレット・リオネス"},"description":"Eldest princess of Liones.","image":{"original":"https://media.kitsu.io/characters/images/57123/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57122","canonicalName":"Bartra Liones","names":{"en":"Bartra Liones","ja_jp":"バルトラ・リオネス"},"description":"The eleventh king of Liones and father of Elizabeth.<br><br>He was held captive after the Seven Deadly Sins were framed for killing the great holy knight Zaratras.","image":{"original":"https://media.kitsu.io/characters/images/57122/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"83362","canonicalName":"Veronica Liones","names":{"en":"Veronica Liones","ja_jp":"ベロニカ・リオネス"},"description":"Veronica is the second princess of Britannia. The younger sibling of the first princess, Margaret, and elder to her adopted sister; the third princess, Elizabeth. She has a tomboyish appearance, short light colored hair and a slim build. She wears a stylish fur coat, a knight-styled attire, a belt and a pair of long boots. <br><br>She is described to be a tomboy, who, as a child, liked to and often used to play with swords with the boys, and would be scolded by her father for doing so. Sharing the Holy Knights' attitude about enslaving the citizens, she also cares about her younger sister, Elizabeth.","image":{"original":"https://media.kitsu.io/characters/images/83362/original.jpg?1485083650","meta":{"dimensions":{}}},"otherNames":[]},{"id":"90694","canonicalName":"Liz","names":{"en":"Liz","ja_jp":"リズ"},"description":"Liz, or Elizabeth, was a knight from an enemy kingdom of Danafor, which attempted night ambush at Danafor, but got captured and sentenced to death. She was saved by Meliodas, the leader of the Holy Knights of Danafor and ended up living in Danafor and eventually also became Meliodas' lover. She is believed to have been killed during Danafor's complete annihilation.","image":{"original":"https://media.kitsu.io/characters/images/90694/original.jpg?1485086498","meta":{"dimensions":{}}},"otherNames":["Elizabeth"]},{"id":"71302","canonicalName":"Luigi","names":{"en":"Luigi","ja_jp":"ルイジ"},"description":"He is the brother of Ellen.","image":{"original":"https://media.kitsu.io/characters/images/71302/original.jpg?1485079154","meta":{"dimensions":{}}},"otherNames":[]},{"id":"83264","canonicalName":"Marmas","names":{"en":"Marmas","ja_jp":"マルマス"},"description":"Marmas is a Holy Knight. He led Guila and Jericho in the assault on Byzel.<br><br>(Source: Nanatsu no Taizai Wikia)","image":{"original":"https://media.kitsu.io/characters/images/83264/original.jpg?1485083612","meta":{"dimensions":{}}},"otherNames":[]},{"id":"90248","canonicalName":"Mead","names":{"en":"Mead","ja_jp":"ミード"},"description":"Mead is an orphan, adopted by the villagers of Bernia after his parents, who were travelers, became victim to an epidemic when they stopped by Bernia.<br><br>(Source: Nanatsu no Taizai Wiki)","image":{"original":"https://media.kitsu.io/characters/images/90248/original.jpg?1485086314","meta":{"dimensions":{}}},"otherNames":[]},{"id":"65187","canonicalName":"Merlin","names":{"en":"Merlin","ja_jp":"マーリン"},"description":"She is a member of the Seven Deadly Sins. She has the mark of the boars sin of gluttony. She was regarded as the greatest mage in Britannia and is the master of Vivian as well as a teacher of King Arthur of Camelot. She came to the aid of the sins in their battle against Hendirkson but had to leave to tend to the King. She has not officially rejoined the sins but said she would as soon as she was finished with her other business.<br><br><span class=\"spoiler\">The day when the Seven Deadly Sins was framed was when Merlin stole most of Meliodas' power, which he cannot control easily.</span>","image":{"original":"https://media.kitsu.io/characters/images/65187/original.jpg?1485074723","meta":{"dimensions":{}}},"otherNames":["Boar's Sin of Gluttony"]},{"id":"57124","canonicalName":"Arthur Pendragon","names":{"en":"Arthur Pendragon","ja_jp":"アーサー・ペンドラゴン"},"description":"Named the king of Camelot after pulling a sword from the stone that hundreds of holy knights could not.<br><br>Arthur is a polite, young man who is still adjusting to his role as king. He takes his responsibilities very seriously, but usually undertakes them with a smile and has a very warm, and happy-go-lucky demeanor.<br><br>He marched toward the kingdom of Liones with an army of illusions created by Merlin in hopes of meeting with the king; however, he was confronted by Hendricksen who tried to kill him before Meliodas came to his aide.","image":{"original":"https://media.kitsu.io/characters/images/57124/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":["King Arthur","Lord Arthur"]},{"id":"57115","canonicalName":"Ruin","names":{"en":"Ruin","ja_jp":"ルイン"},"description":"A holy knight of the weird fangs whom wishes to bring ruin to the seven deadly sins. Claims his body is his true armor, and more durable than steel. Hypnotizes both Melodidas and Diane into fighting each other with his bell. Easily defeated by Melodidas after Elizabeth tore the hypnotizing bell off his staff.","image":{"original":"https://media.kitsu.io/characters/images/57115/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"65925","canonicalName":"Sennett","names":{"en":"Sennett","ja_jp":"セネット"},"description":"","image":{"original":"https://media.kitsu.io/characters/images/65925/original.jpg?1485074987","meta":{"dimensions":{}}},"otherNames":[]},{"id":"73900","canonicalName":"Simon","names":{"en":"Simon","ja_jp":"サイモン"},"description":"","image":{"original":"https://media.kitsu.io/characters/images/73900/original.jpg?1485080100","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57118","canonicalName":"Slader","names":{"en":"Slader","ja_jp":"スレイダー"},"description":"Slader was kidnapped and raised as a child by savages who held no regard for his worth as a human. After being freed by the king of Liones he pledged loyalty and resolved to hunt down any who wronged the kingdom.<br><br>He is a member of Dawn Roar who holds a rivalry against Gowther of the Seven Deadly Sins.","image":{"original":"https://media.kitsu.io/characters/images/57118/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"72866","canonicalName":"Taizoo","names":{"en":"Taizoo","ja_jp":"タイズー"},"description":"","image":{"original":"https://media.kitsu.io/characters/images/72866/original.jpg?1485079734","meta":{"dimensions":{}}},"otherNames":[]},{"id":"57110","canonicalName":"Twigo","names":{"en":"Twigo","ja_jp":"ツイーゴ"},"description":"Twigo was an apprentice Holy Knight who was stationed near Caines Village. After his defeat by Meliodas, he, wanting to gain greater powers, drank the demon's blood, but died since he was incompatible.","image":{"original":"https://media.kitsu.io/characters/images/57110/original.jpg?1483096805","meta":{"dimensions":{}}},"otherNames":[]},{"id":"77890","canonicalName":"Vivian","names":{"en":"Vivian","ja_jp":"ビビアン"},"description":"Vivian is an enigmatic Holy Knight once directly serving under Great Holy Knight Hendrickson and used to be an apprentice of Merlin, the Boar's Sin Gluttony. Vivian is regarded as the kingdom of Liones' greatest mage.<br><br>(Source: Nanatsu no Taizai Wiki)","image":{"original":"https://media.kitsu.io/characters/images/77890/original.jpg?1485081509","meta":{"dimensions":{}}},"otherNames":[]},{"id":"92620","canonicalName":"Zaratras","names":{"en":"Zaratras","ja_jp":"ザラトラス"},"description":"Zaratras was a Great Holy Knight and was once the strongest in the order of Liones' Holy Knights before his death ten years prior to the beginning of series. He is also the father of the Holy Knight, Gilthunder, and was the Seven Deadly Sins' superior.","image":{"original":"https://media.kitsu.io/characters/images/92620/original.jpg?1485087383","meta":{"dimensions":{}}},"otherNames":["Silver"]},{"id":"80000","canonicalName":"Zeal","names":{"en":"Zeal","ja_jp":"ジール"},"description":"Guila's younger brother.","image":{"original":"https://media.kitsu.io/characters/images/80000/original.jpg?1485082274","meta":{"dimensions":{}}},"otherNames":[]}],"genres":[{"slug":"magic","name":"Magic"},{"slug":"supernatural","name":"Supernatural"},{"slug":"fantasy","name":"Fantasy"},{"slug":"action","name":"Action"},{"slug":"ecchi","name":"Ecchi"},{"slug":"adventure","name":"Adventure"}],"streamers":[{"id":"3614","url":"https://www.netflix.com/title/80050063","siteName":"Netflix"}]}
